Пансион83/src/Catalogs/ВзамВнешниеСистемы/ВзамВнешниеСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВзамВнешниеСистемы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>InteractionID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>38</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Parameters</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>IsActive</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ActiveFromDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ActiveToDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ActiveDays</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Login</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Password</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SessionID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>38</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SessionStartTime</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>SessionLastActivityTime</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>SessionTimeout</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FullSynchronizationTime</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LastFullSynchronizationTime</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>IsByCheckInPeriods</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsByAllotments</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WSHost</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Allotment</name>
    <type>
      <types>CatalogRef.КвотаНомеров</types>
    </type>
  </attributes>
  <attributes>
    <name>DebugMode</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseClient</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Пансион83/src/Catalogs/ВзамВнешниеСистемы/ObjectModule.bsl
//-----------------------------------------------------------------------------
Процедура pmClearSessionAttributes() Экспорт
	SessionID = "";
	SessionStartTime = '00010101';
	SessionLastActivityTime = '00010101';
КонецПроцедуры //pmClearSessionAttributes

//-----------------------------------------------------------------------------
Процедура pmSetNewSessionAttributes(pSessionID) Экспорт
	SessionID = TrimR(pSessionID);
	SessionStartTime = CurrentDate();
	SessionLastActivityTime = SessionStartTime;
КонецПроцедуры //pmSetNewSessionAttributes

//-----------------------------------------------------------------------------
Процедура pmUpdateSessionAttributes(pFull = True) Экспорт
	SessionLastActivityTime = CurrentDate();
	If pFull Тогда
		LastFullSynchronizationTime = SessionLastActivityTime;
	EndIf;
КонецПроцедуры //pmUpdateSessionAttributes

//-----------------------------------------------------------------------------
Процедура OnSetNewCode(pStandardProcessing, pPrefix)
	pStandardProcessing = False;
	vUUID = New UUID();
	Code = String(vUUID);
КонецПроцедуры //OnSetNewCode
